<!-- Creator     : groff version 1.18.1.4 -->
<!-- CreationDate: Sat Nov 12 22:03:12 2016 -->
<html>
<head>
<meta name="generator" content="groff -Thtml, see www.gnu.org">
<meta name="Content-Style" content="text/css">
<title></title>
</head>
<body>

<hr>

<p>GROFF_CHAR(7) GROFF_CHAR(7)</p>

<p>NAME groff_char - groff character names</p>

<p>DESCRIPTION This manual page lists the standard groff
input characters. The output characters in this document
will look different depending on which out- put device was
chosen (with option -T for the man(1) program or the roff
formatter). Only the characters that are available for the
device that is being used to print or view this manual page
will be displayed (the device currently used is utf8).</p>

<p>In the actual version, groff provides only 8-bit
characters for direct input and named characters for further
glyphs. On ASCII platforms, character codes in the range 0
to 127 (decimal) represent the usual 7-bit ASCII characters,
while codes between 127 and 255 are interpreted as the
corresponding characters in the Latin-1 (ISO-8859-1) code
set. On EBCDIC platforms, only the code page cp1047 is
supported (which con- tains the same characters as Latin-1).
It is rather straightforward (for the experienced user) to
set up other 8bit encodings like Latin-2; since groff will
use Unicode in the next major version, no additional
encodings are provided.</p>

<p>All roff systems provide the concept of named
characters. In tradi- tional roff systems, only names of
length 2 were used, while groff also provides support for
longer names. It is strongly suggested that only named
characters are used for all characters outside of the 7-bit
ASCII range.</p>

<p>Some of the predefined groff escape sequences (with
names of length 1) also produce single characters; these
exist for historical reasons or are printable versions of
syntactical characters. They include, ,-,., ande; see
groff(7).</p>

<p>In groff, all of these different types of characters can
be tested pos- itively with the .if c conditional.</p>

<p>REFERENCE In this section, the characters in groff are
specified in tabular form. The meaning of the columns is as
follows.</p>

<p>Output shows how the character is printed for the
current device; although this can have quite a different
shape on other devices, it always represents the same
glyph.</p>

<p>Input name specifies how the character is input either
directly by a key on the keyboard, or by a groff escape
sequence.</p>

<p>Input code applies to characters which can be input with
a single charac- ter, and gives the ISO Latin-1 decimal code
of that input char- acter. Note that this code is equivalent
to the lowest 256 Uni- code characters; (including 7-bit
ASCII in the range 0 to 127).</p>

<p>PostScript name gives the usual PostScript name of the
output character.</p>

<p>ASCII Characters These are the basic characters having
7-bit ASCII code values. These are identical to the first
127 characters of the character standards ISO-8859-1
(Latin-1) and Unicode (range C0 Controls and Basic Latin).
To save space, not every code has an entry in the following
because the following code ranges are well known.</p>

<p>0-32 Control characters (print as themselves).</p>

<p>48-57 Decimal digits 0 to 9 (print as themselves).</p>

<p>65-90 Upper case letters A-Z (print as themselves).</p>

<p>97-122 Lower case letters a-z (print as themselves).</p>

<p>127 Control character (prints as itself).</p>

<p>The remaining ranges constitute the printable,
non-alphanumeric ASCII characters; only these are listed
below. As can be seen in the table below, most of these
characters print as themselves; the only excep- tions are
the following characters:</p>

<p>&lsquo; the ISO Latin-1 Grave Accent (code 96) prints as
, a left single quotation mark,</p>

<p>&rsquo; the ISO Latin-1 Apostrophe (code 39) prints as ,
a right sin- gle quotation mark; the corresponding ISO
Latin-1 characters can be obtained withand(aq.</p>

<p>- the ISO Latin-1 Hyphen, Minus Sign (code 45) prints as
a hyphen; a minus sign can be obtained with-.</p>

<p>~ the ISO Latin-1 Tilde (code 126); a larger glyph can
be obtained with(ti.</p>

<p>^ the ISO Latin-1 Circumflex Accent (code 94); a larger
glyph can be obtained with(ha.</p>

<p>Output Input Input PostScript Notes name code name</p>

<p>! ! 33 exclam &quot; &quot; 34 quotedbl # # 35
numbersign $ $ 36 dollar % % 37 percent &amp; &amp; 38
ampersand &rsquo; 39 quoteright ( ( 40 parenleft ) ) 41
parenright * * 42 asterisk + + 43 plus , , 44 comma - - 45
hyphen . . 46 period / / 47 slash : : 58 colon ; ; 59
semicolon &lt; &lt; 60 less = = 61 equal &gt; &gt; 62
greater ? ? 63 question @ @ 64 at [ [ 91 bracketleft 92
backslash ] ] 93 bracketright ^ ^ 94 circumflex circumflex
accent _ _ 95 underscore &lsquo; 96 quoteleft { { 123
braceleft | | 124 bar } } 125 braceright ~ ~ 126 tilde tilde
accent</p>

<p>Latin-1 Special Characters These characters have
character codes between 128 and 255. They are interpreted as
characters according to the Latin-1 (iso-8859-1) code set,
being identical to the Unicode range C1 Controls and Latin-1
Sup- plement.</p>

<p>128-159 the C1 Controls; they print as themselves, but
the effect is mostly undefined.</p>

<p>160 the ISO Latin-1 no-break space is mapped to, the
escaped space character.</p>

<p>173 the soft hyphen control character (prints as
itself). groff never use this character for output (thus it
is omitted in the table below); the input character 173 is
mapped ont%.</p>

<p>The remaining ranges (161-172, 174-255), called the
Latin-1 Supplement in Unicode, are printable characters that
print as themselves. Although they can be specified directly
with the keyboard on systems with a Latin-1 code page, it is
better to use their named character equivalent; see next
section.</p>

<p>Output Input Input PostScript Notes name code name</p>

<p>&iexcl; &iexcl; 161 exclamdown inverted exclamation mark
&cent; &cent; 162 cent &pound; &pound; 163 sterling &curren;
&curren; 164 currency &yen; &yen; 165 yen &brvbar; &brvbar;
166 brokenbar &sect; &sect; 167 section &uml; &uml; 168
dieresis &copy; &copy; 169 copyright &ordf; &ordf; 170
ordfeminine &laquo; &laquo; 171 guillemotleft &not; &not;
172 logicalnot &reg; &reg; 174 registered &macr; &macr; 175
macron &deg; &deg; 176 degree &plusmn; &plusmn; 177
plusminus &sup2; &sup2; 178 twosuperior &sup3; &sup3; 179
threesuperior &acute; &acute; 180 acute acute accent &micro;
&micro; 181 mu micro sign &para; &para; 182 paragraph
&middot; &middot; 183 periodcentered &cedil; &cedil; 184
cedilla &sup1; &sup1; 185 onesuperior &ordm; &ordm; 186
ordmasculine &raquo; &raquo; 187 guillemotright &frac14;
&frac14; 188 onequarter &frac12; &frac12; 189 onehalf
&frac34; &frac34; 190 threequarters &iquest; &iquest; 191
questiondown &Agrave; &Agrave; 192 Agrave &Aacute; &Aacute;
193 Aacute &Acirc; &Acirc; 194 Acircumflex &Atilde; &Atilde;
195 Atilde &Auml; &Auml; 196 Adieresis &Aring; &Aring; 197
Aring &AElig; &AElig; 198 AE &Ccedil; &Ccedil; 199 Ccedilla
&Egrave; &Egrave; 200 Egrave &Eacute; &Eacute; 201 Eacute
&Ecirc; &Ecirc; 202 Ecircumflex &Euml; &Euml; 203 Edieresis
&Igrave; &Igrave; 204 Igrave &Iacute; &Iacute; 205 Iacute
&Icirc; &Icirc; 206 Icircumflex &Iuml; &Iuml; 207 Idieresis
&ETH; &ETH; 208 Eth &Ntilde; &Ntilde; 209 Ntilde &Ograve;
&Ograve; 210 Ograve &Oacute; &Oacute; 211 Oacute &Ocirc;
&Ocirc; 212 Ocircumflex &Otilde; &Otilde; 213 Otilde &Ouml;
&Ouml; 214 Odieresis &times; &times; 215 multiply &Oslash;
&Oslash; 216 Oslash &Ugrave; &Ugrave; 217 Ugrave &Uacute;
&Uacute; 218 Uacute &Ucirc; &Ucirc; 219 Ucircumflex &Uuml;
&Uuml; 220 Udieresis &Yacute; &Yacute; 221 Yacute &THORN;
&THORN; 222 Thorn &szlig; &szlig; 223 germandbls &agrave;
&agrave; 224 agrave &aacute; &aacute; 225 aacute &acirc;
&acirc; 226 acircumflex &atilde; &atilde; 227 atilde &auml;
&auml; 228 adieresis &aring; &aring; 229 aring &aelig;
&aelig; 230 ae &ccedil; &ccedil; 231 ccedilla &egrave;
&egrave; 232 egrave &eacute; &eacute; 233 eacute &ecirc;
&ecirc; 234 ecircumflex &euml; &euml; 235 edieresis &igrave;
&igrave; 236 igrave &iacute; &iacute; 237 iacute &icirc;
&icirc; 238 icircumflex &iuml; &iuml; 239 idieresis &eth;
&eth; 240 eth &ntilde; &ntilde; 241 ntilde &ograve; &ograve;
242 ograve &oacute; &oacute; 243 oacute &ocirc; &ocirc; 244
ocircumflex &otilde; &otilde; 245 otilde &ouml; &ouml; 246
odieresis &divide; &divide; 247 divide &oslash; &oslash; 248
oslash &ugrave; &ugrave; 249 ugrave &uacute; &uacute; 250
uacute &ucirc; &ucirc; 251 ucircumflex &uuml; &uuml; 252
udieresis &yacute; &yacute; 253 yacute &thorn; &thorn; 254
thorn &yuml; &yuml; 255 ydieresis</p>

<p>Named Characters The named character idiom is the
standard way to specify special char- acters in roff
systems. They can be embedded into the document text by
using escape sequences. groff(7) describes how these escape
sequences look. The character names can consist of quite
arbitrary characters from the ASCII or Latin-1 code set, not
only alphanumeric characters. Here some examples:</p>

<p>c named character having the name c, which consists of a
single character (length 1).</p>

<p>(ch named character having the 2-character name ch.</p>

<p>[char_name] named character having the name char_name
(having length 1, 2, 3, ...).</p>

<p>In groff, each 8bit input character can also referred to
by the con- struct n[charn] where n is the decimal code of
the character, a number between 0 and 255 without leading
zeros. They are mapped onto glyph entities using the .trin
request. Moreover, new character names can be created by the
.char request; see groff(7).</p>

<p>Output Input PostScript Notes name name</p>

<p>&ETH; &ETH; Eth Icelandic uppercase eth &eth; &eth; eth
Icelandic lowercase eth &THORN; &THORN; Thorn Icelandic
uppercase thorn &thorn; &thorn; thorn Icelandic lowercase
thorn &szlig; &szlig; germandbls German sharp s</p>

<p>Ligatures ff ff ff ligature fi fi fi ligature fl fl fl
ligature ffi ffi ffi ligature ffl ffl ffl ligature &AElig;
&AElig; AE &aelig; &aelig; ae &OElig; OE &oelig; oe &#305;
dotlessi i without a dot (Turkish)</p>

<p>Accented Characters &Aacute; &Aacute; Aacute &Eacute;
&Eacute; Eacute &Iacute; &Iacute; Iacute &Oacute; &Oacute;
Oacute &Uacute; &Uacute; Uacute &Yacute; &Yacute; Yacute
&aacute; &aacute; aacute &eacute; &eacute; eacute &iacute;
&iacute; iacute &oacute; &oacute; oacute &uacute; &uacute;
uacute &yacute; &yacute; yacute &Auml; &Auml; Adieresis A
with umlaut &Euml; &Euml; Edieresis &Iuml; &Iuml; Idieresis
&Ouml; &Ouml; Odieresis &Uuml; &Uuml; Udieresis &Yuml;
Ydieresis &auml; &auml; adieresis &euml; &euml; edieresis
&iuml; &iuml; idieresis &ouml; &ouml; odieresis &uuml;
&uuml; udieresis &yuml; &yuml; ydieresis &Acirc; &Acirc;
Acircumflex &Ecirc; &Ecirc; Ecircumflex &Icirc; &Icirc;
Icircumflex &Ocirc; &Ocirc; Ocircumflex &Ucirc; &Ucirc;
Ucircumflex &acirc; &acirc; acircumflex &ecirc; &ecirc;
ecircumflex &icirc; &icirc; icircumflex &ocirc; &ocirc;
ocircumflex &ucirc; &ucirc; ucircumflex &Agrave; &Agrave;
Agrave &Egrave; &Egrave; Egrave &Igrave; &Igrave; Igrave
&Ograve; &Ograve; Ograve &Ugrave; &Ugrave; Ugrave &agrave;
&agrave; agrave &egrave; &egrave; egrave &igrave; &igrave;
igrave &ograve; &ograve; ograve &ugrave; &ugrave; ugrave
&Atilde; &Atilde; Atilde &Ntilde; &Ntilde; Ntilde &Otilde;
&Otilde; Otilde &atilde; &atilde; atilde &ntilde; &ntilde;
ntilde &otilde; &otilde; otilde &Scaron; Scaron &scaron;
scaron &#381; Zcaron &#382; zcaron &Ccedil; &Ccedil;
Ccedilla &ccedil; &ccedil; ccedilla &#321; Lslash Polish L
with a slash &#322; lslash Polish l with a slash &Oslash;
&Oslash; Oslash Scandinavic slashed O &oslash; &oslash;
oslash Scandinavic slashed o &Aring; &Aring; Aring &aring;
&aring; aring</p>

<p>Accents &#733; hungarumlaut Hungarian umlaut &macr;
&macr; macron macron or bar accent &#729; dotaccent dot
accent ^ ^ circumflex circumflex accent &acute; &acute;
acute acute accent &lsquo; ` grave grave accent &#728; breve
breve accent &cedil; &cedil; cedilla cedilla accent &uml;
&uml; dieresis umlaut or dieresis &#711; caron h&aacute;ek
accent &#730; ring ring or circle accent ~ ~ tilde tilde
accent &#731; ogonek hook or ogonek accent ^ ^ asciicircum
ASCII circumflex, hat, caret &sim; asciitilde ASCII tilde,
large tilde</p>

<p>Quotes &bdquo; quotedblbase low double comma quote
&sbquo; quotesinglbase low single comma quote &ldquo;
quotedblleft &rdquo; quotedblright &lsquo; quoteleft single
open quote &rsquo; quoteright single closing quote (ASCII
39) &rsquo; ' quotesingle apostrophe quote &quot; &quot;
quotedbl double quote (ASCII 34) &laquo; &laquo;
guillemotleft &raquo; &raquo; guillemotright &lsaquo;
guilsinglleft &rsaquo; guilsinglright</p>

<p>Punctuation &iexcl; &iexcl; exclamdown &iquest; &iquest;
questiondown &mdash; emdash em dash &ndash; endash en dash -
- hyphen</p>

<p>Brackets [ [ bracketleft ] ] bracketright { { braceleft
} } braceright &lang; angleleft left angle bracket &rang;
angleright right angle bracket</p>

<p>Arrows &larr; arrowleft &rarr; arrowright &harr;
arrowboth horizontal double-headed arrow &darr; arrowdown
&uArr; arrowup &lArr; arrowdblleft &rArr; arrowdblright
&hArr; arrowdblboth horizontal double-headed double arrow
&dArr; arrowdbldown &uArr; arrowdblup &#9472; arrowhorizex
horizontal arrow extension</p>

<p>Lines | | bar | | bar &#9474; br box rule with
traditional troff metrics _ _ ru baseline rule _ _ ul
underline with traditional troff metrics &#9474; bv bar
vertical &brvbar; &brvbar; brokenbar / / slash \
backslash</p>

<p>Text markers &#9711; circle &middot; &bull; bullet
&Dagger; daggerdbl double dagger sign &dagger; dagger &loz;
lozenge &#9633; square &para; &para; paragraph &sect; &sect;
section &#9756; handleft &#9758; handright @ @ at # #
numbersign &#9229; carriagereturn carriage return symbol</p>

<p>Legalize &copy; &copy; copyright &reg; &reg; registered
&trade; trademark</p>

<p>Currency symbols $ dollar &cent; &cent; cent &euro;
official Euro symbol &euro; Euro font-specific Euro glyph
variant &yen; &yen; yen &pound; &pound; sterling British
currency sign &curren; &curren; currency Scandinavian
currency sign &fnof; florin Dutch currency sign</p>

<p>Units &deg; &deg; degree &permil; perthousand per
thousand, per mille sign &prime; minute footmark, prime
&Prime; second &micro; &micro; mu micro sign &ordf; &ordf;
ordfeminine &ordm; &ordm; ordmasculine</p>

<p>Logical Symbols &and; logicaland &or; logicalor &not;
&not; logicalnot &exist; existential there exists,
existential quantifier &forall; universal for all, universal
quantifier &ni; suchthat &there4; therefore &there4;
therefore</p>

<p>Mathematical Symbols &frac12; &frac12; onehalf &frac14;
&frac14; onequarter &frac34; &frac34; threequarters &sup1;
&sup1; onesuperior &sup2; &sup2; twosuperior &sup3; &sup3;
threesuperior + + plusmath plus sign in special font -
&minus; minus minus sign from current font &plusmn; &plusmn;
plusminus &plusmn; &plusmn; plusminus text variant of +-
&middot; &middot; periodcentered multiplication dot &sdot;
dotmath &times; &times; multiply &times; &times; multiply
text variant of mu &otimes; circlemultiply multiply sign in
a circle &oplus; circleplus plus sign in a circle &divide;
&divide; divide division sign &divide; &divide; divide text
variant of di &frasl; fraction bar for fractions &lowast;
asteriskmath &le; lessequal &ge; greaterequal &ne; notequal
= = equalmath equals sign in special font &equiv;
equivalence &cong; congruent &sim; similar &asymp;
approxequal &asymp; approxequal &prop; proportional &empty;
emptyset &isin; element &notin; notelement &nsub; notsubset
&sub; propersubset &sup; propersuperset &sube; reflexsubset
&supe; reflexsuperset &cap; intersection intersection, cap
&cup; union union, cup &ang; angle &perp; perpendicular
&int; integral &sum; sum &prod; product &nabla; gradient
&radic; radical square root &oline; overline &infin;
infinity &alefsym; aleph &image; Ifraktur Gothic I,
imaginary &real; Rfraktur Gothic R, real &weierp;
weierstrass Weierstrass p &part; partialdiff partial
differentiation sign</p>

<p>Greek characters &Alpha; Alpha &Beta; Beta &Xi; Xi
&Delta; Delta &Epsilon; Epsilon &Phi; Phi &Gamma; Gamma
&Theta; Theta &Iota; Iota &Kappa; Kappa &Lambda; Lambda &Mu;
Mu &Nu; Nu &Omicron; Omicron &Pi; Pi &Psi; Psi &Rho; Rho
&Sigma; Sigma &Tau; Tau &Upsilon; Upsilon &Omega; Omega
&Chi; Chi &Eta; Eta &Zeta; Zeta &alpha; alpha &beta; beta
&xi; xi &delta; delta &epsilon; epsilon &phi; phi &#981;
phi1 variant phi &gamma; gamma &theta; theta &thetasym;
theta1 variant theta &iota; iota &kappa; kappa &lambda;
lambda &mu; mu &nu; nu &omicron; omicron &pi; pi &piv;
omega1 variant pi, looking like omega &psi; psi &rho; rho
&sigma; sigma &tau; tau &upsilon; upsilon &omega; omega
&chi; chi &eta; eta &zeta; zeta &sigmaf; sigma1 terminal
sigma</p>

<p>Card symbols &clubs; club club suit &spades; spade spade
suit &hearts; heart heart suit &diams; diamond diamond
suit</p>

<p>AUTHOR Copyright &copy; 1989-2000, 2001, 2002 Free
Software Foundation, Inc.</p>

<p>This document is distributed under the terms of the FDL
(GNU Free Docu- mentation License) version 1.1 or later. You
should have received a copy of the FDL on your system, it is
also available on-line at the GNU copyleft site
http://www.gnu.org/copyleft/fdl.html.</p>

<p>This document is part of groff, the GNU roff
distribution. It was written by James Clark jjc@jclark.com
with additions by Werner Lem- berg wl@gnu.org and Bernd
Warken bwarken@mayn.de.</p>

<p>SEE ALSO groff(1) the GNU roff formatter.</p>

<p>groff(7) a short reference of the groff formatting
language.</p>

<p>An extension to the troff character set for Europe, E.G.
Keizer, K.J. Simonsen, J. Akkerhuis; EUUG Newsletter, Volume
9, No. 2, Summer 1989</p>

<p>The Unicode Standard http://www.unicode.org</p>

<p>Groff Version 1.18.1.4 19 July 2002 GROFF_CHAR(7)</p>
<hr>
</body>
</html>
